Repository: Cardlink-SA/cardlink-payment-gateway-woocommerce
Catalog: languages/cardlink-payment-gateway-*.po
Languages: el

source: Number of installments
el: Αριθμός δόσεων

source: Total order amount
el: Συνολικό ποσό παραγγελίας

source: Add variation
el: Προσθήκη παραλλαγής

source: No results
el: Δε βρέθηκαν αποτελέσματα

source: Cardlink Payment Gateway allows you to accept payment through various schemes such as Visa, Mastercard, Maestro, American Express, Diners, Discover cards on your Woocommerce Powered Site.
el: Με το Cardlink Payment Gateway μπορείτε να δέχεστε πληρωμές στο Woocommerce e-shop σας μέσω διαφορετικών σχημάτων, όπως Visa, Mastercard, Maestro, American Express, Diners και Discover.

source: Return to payments
el: Επιστροφή στη σελίδα πληρωμής

source: Cardlink Payment Gateway allows you to accept payment through credit cards.
el: Επιστροφή στη σελίδα πληρωμής.

source: Enable/Disable
el: Ενεργοποίηση/Απενεργοποίηση

source: Enable Cardlink Payment Gateway
el: Ενεργοποίηση του Cardlink Payment Gateway

source: Enable or disable the gateway.
el: Ενεργοποίηση του Cardlink Payment Gateway.

source: Test Environment
el: Περιβάλλον δοκιμών

source: Enable Cardlink Test Environment
el: Ενεργοποίηση του περιβάλλοντος δοκιμών της Cardlink

source: Select Acquirer
el: Επιλέξτε οργανισμό αποδοχής πληρωμών

source: Select your acquirer bank
el: Επιλέξτε οργανισμό αποδοχής πληρωμών

source: Title
el: Τίτλος

source: This controls the title which the user sees during checkout.
el: Ελέγχει τον τίτλο που βλέπει ο χρήστης στη σελίδα πληρωμής.

source: Credit card via Cardlink
el: Πληρωμή με κάρτα μέσω της Cardlink

source: Description
el: Περιγραφή

source: This controls the description which the user sees during checkout.
el: Ελέγχει την περιγραφή που βλέπει ο χρήστης στη σελίδα πληρωμής.

source: Pay Via Cardlink: Accepts Visa, Mastercard, Maestro, American Express, Diners, Discover.
el: Πληρώστε μέσω της Cardlink: Δέχεται Visa, Mastercard, Maestro, American Express, Diners και Discover.

source: Merchant ID
el: MID επιχείρησης

source: Enter Your Cardlink Merchant ID
el: Εισάγετε το Cardlink MID της επιχείρησης

source: Enter your Shared Secret key
el: Εισάγετε το Shared Secret key

source: Maximum number of installments depending on the total order amount
el: Μέγιστος αριθμός δόσεων ανάλογα με το συνολικό ποσό αγοράς

source: Add amount and installments for each row. The limit is 10.
el: Προσθέστε ποσό και δόσεις για κάθε σειρά. Το ανώτατο όριο είναι 10.

source: Pre-Authorize
el: Προ-έγκριση

source: Enable to capture preauthorized payments
el: Ενεργοποίηση είσπραξης πληρωμών με προέγκριση

source: Default payment method is Purchase, enable for Pre-Authorized payments. You will then need to accept them from Cardlink eCommerce Tool.
el: Η προεπιλεγμένη μέθοδος πληρωμής είναι η Αγορά. Ενεργοποιήστε τις πληρωμές με Προέγκριση. Στη συνέχεια θα πρέπει να τις αποδεχτείτε από το Cardlink Payment Gateway.

source: Store card details
el: Αποθήκευση των στοιχείων της κάρτας

source: Enable Tokenization
el: Ενεργοποίηση Tokenization

source: If checked the user will have the ability to store credit card details for future purchases. You must contact Cardlink first.
el: Εάν επιλεγεί, ο χρήστης θα έχει τη δυνατότητα αποθήκευσης στοιχείων πιστωτικής κάρτας για μελλοντικές αγορές. Πρέπει πρώτα να επικοινωνήσετε με την Cardlink.

source: Return page URL <br />(Successful or Failed Transactions)
el: URL σελίδας επιστροφής <br /> (Επιτυχημένες ή Αποτυχημένες Συναλλαγές)

source: We recommend you to select the default “Thank You Page”, in order to automatically serve both successful and failed transactions, with the latter also offering the option to try the payment again.<br /> If you select a different page, you will have to handle failed payments yourself by adding custom code.
el: Σας συνιστούμε να επιλέξετε την προεπιλεγμένη «Thank you» σελίδα προκειμένου να εξυπηρετούνται αυτόματα τόσο οι επιτυχημένες όσο και οι αποτυχημένες συναλλαγές. Για τις αποτυχημένες προσφέρεται η επιλογή να γίνει εκ νέου η πληρωμή.<br /> Αν επιλέξετε διαφορετική σελίδα, θα πρέπει να διαχειριστείτε μόνοι σας τις αποτυχημένες πληρωμές, προσθέτοντας δικό σας κώδικα.

source: Pay in website
el: Πληρωμή μέσω σελίδας στο κατάστημα

source: Enable payment iframe
el: Ενεργοποίηση πληρωμής μέσω iframe

source: Url of custom CSS stylesheet, to be used to display payment page styles.
el: URL του CSS stylesheet που θα χρησιμοποιηθεί για την εμφάνιση των σελίδων πληρωμής.

source: Enable Debug mode
el: Ενεργοποίηση λειτουργίας Εντοπισμού Σφαλμάτων

source: Enabling this will log certain information
el: Η ενεργοποίηση της λειτουργίας θα οδηγήσει στην καταγραφή ορισμένων πληροφοριών

source: Enabling this (and the debug mode from your wp-config file) will log information, e.g. responses, which will help in debugging issues.
el: Η ενεργοποίηση της λειτουργίας (και της λειτουργίας Εντοπισμού Σφαλμάτων από το αρχείο σας wp-config) θα οδηγήσει στην καταγραφή πληροφοριών, π.χ. αποκρίσεων, οι οποίες θα σας βοηθήσουν στον εντοπισμό σφαλμάτων.

source: Choose Installments
el: Επιλέξτε δόσεις

source: Without installments
el: Χωρίς δόσεις

source: Remove card
el: Αφαίρεση κάρτας

source: Add your credit card
el: Προσθήκη κάρτας

source: New card
el: Νέα κάρτα

source: Store your card?
el: Θέλετε να αποθηκεύσετε την κάρτα σας;

source: Thank you for your order. We are now redirecting you to Cardlink to make payment.
el: Ευχαριστούμε για την παραγγελία σας. Σας ανακατευθύνουμε στη σελίδα πληρωμών της Cardlink για να διεκπεραιώσετε την πληρωμή σας.

source: Pay via Cardlink
el: Πληρώστε με Cardlink checkout

source: Thank you for your order. We are now redirecting you to Cardlink Paycenter to make payment.
el: Ευχαριστούμε για την παραγγελία σας. Σας ανακατευθύνουμε στη Σελίδα Πληρωμών της Cardlink για να διεκπεραιώσετε την πληρωμή σας.

source: A technical problem occured. <br />The transaction wasn't successful, payment wasn't received.
el: Παρουσιάστηκε ένα τεχνικό πρόβλημα. <br />Μη επιτυχής συναλλαγή λόγω τεχνικού προβλήματος. Η πληρωμή σας δεν ολοκληρώθηκε.

source: Payment Via Cardlink<br />Transaction ID:
el: Πληρωμή μέσω της Cardlink<br />Αναγνωριστικό Συναλλαγής:

source: Thank you for shopping with us.<br />Your transaction was successful, payment was received.<br />Your order is currently being processed.
el: Ευχαριστούμε που μας επιλέξατε.<br />Η συναλλαγή σας ήταν επιτυχής. Λάβαμε την πληρωμή.<br />Η παραγγελία σας βρίσκεται στο στάδιο της επεξεργασίας.

source: Payment Received.<br />Your order is currently being processed.<br />We will be shipping your order to you soon.<br />Cardlink ID:
el: Λάβαμε την πληρωμή.<br />Η παραγγελία σας βρίσκεται στο στάδιο της επεξεργασίας.<br />Θα σας αποστείλουμε την παραγγελία σας σύντομα.<br />Αναγνωριστικό ID Cardlink:

source: Thank you for shopping with us.<br />Your transaction was successful, payment was received.<br />Your order is now complete.
el: Ευχαριστούμε που μας επιλέξατε.<br />Η συναλλαγή σας ήταν επιτυχής. Λάβαμε την πληρωμή.<br />Η παραγγελία σας ολοκληρώθηκε.

source: Payment Received.<br />Your order is now complete.<br />Cardlink Transaction ID:
el: Λάβαμε την πληρωμή.<br />Η παραγγελία σας ολοκληρώθηκε.<br />Αναγνωριστικό συναλλαγής Cardlink:

source: Thank you for shopping with us. <br />However, the transaction wasn't successful, payment was cancelled.
el: Ευχαριστούμε που μας επιλέξατε. <br />Ωστόσο, η συναλλαγή δεν ήταν επιτυχής. Η πληρωμή ακυρώθηκε.

source: Thank you for shopping with us. <br />However, the transaction wasn't successful, payment wasn't received.
el: Ευχαριστούμε που μας επιλέξατε. <br />Ωστόσο, η συναλλαγή δεν ήταν επιτυχής. Δεν λάβαμε την πληρωμή.
